---
kind: property
id: P:Autodesk.Revit.UI.Events.ThemeChangedEventArgs.ThemeChangedType
source: html/e109b014-663d-b479-8a74-a063edaa4fd9.htm
---
# Autodesk.Revit.UI.Events.ThemeChangedEventArgs.ThemeChangedType Property

Get the application frame theme Type.

## Syntax (C#)
```csharp
public ThemeType ThemeChangedType { get; }
```